#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<stdlib.h>
int main()
{
	int a = 3;//a是正数 原码，反码，补码相同
	int b = -5;
	int c = a ^ b;
	printf("%d ", c);//结果为-8
	//a的补码：00000000 00000000 00000000 00000011 
	 //c的原码：10000000 00000000 00000000 00000101  先写出原码
	//c的反码：11111111 11111111 11111111 11111010  原码除符号位外 其他位按位取反为反码
	//c的补码：11111111 11111111 11111111 11111011  反码+1为补码

	//a的补码：00000000 00000000 00000000 00000011 
	//c的补码：11111111 11111111 11111111 11111011 按位异或 相同为0 相异为1
	//a^c     11111111 11111111 11111111 11111000 补码 转成原码 -1后取反 或取反+1
	//取反    10000000 00000000 00000000 00000111
	//+1     00000000  00000000  00000000 00001000// 转成原码后二进制数字为-8


	return 0;
}