#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)
#include<stdio.h>  
#include<string.h>
//x86,小端字节序
int main()
{
	int a[4] = { 1,2,3,4 };
	int* ptr1 = (int*)(&a + 1);//&a-数组指针 &a+1指向元素4的末位置地址
	int* ptr2 = (int*)((int)a + 1);
	printf("%x,%x", ptr1[-1], *ptr2);//%x占位符-将数字以十六进制的形式打印
	//ptr1[-1] = *(ptr-1)-指向元素4 ptr1[-1]为4
	//a为首元素地址 01 00 00 00 - 02 00 00 00 - 03 00 00 00 - 04 00 00 00
	//a指向01的起始地址,(int)a+1 -将地址转成整型+1即跳过一个字节 指向00
	//因为ptr2是整型指针,所以为四个字节大小,取出的值用小端字节序(低位字节保存到低地址,高位字节保存到高地址)-02 00 00 00打印结果为2 00 00 00
	return 0;
}

int main5()
{
	unsigned int i = 0;//unsigned int表示正数,都是大于等于0的
	//i>=0的循环条件恒成立,for循环也是死循环
	for (i = 9; i >= 0; i++)
	{
		printf("%u\n", i);//打印无符号数 i
	}
	return 0;
}



//unsigned char 的取值范围是 0~255
//for循环的循环条件恒成立,那么循环将会进入死循环
unsigned char i = 0;
int main4()
{

	for (int i = 0; i <= 255; i++)
	{
		printf("hello world");
	}
	return 0;
}


int main3()
{
	char a[1000];//下标为0~999
	int i = 0;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	//-128-1 = 127
	//-1 -2 -3 -4 -5...-127 -128  127 125 .... 4 3 2 1 0 -1 -2
	printf("%zd", strlen(a));//strlen计算字符串长度,统计遇到\0(ascii码值为0)之前的字符个数
	//在0之前有255个元素
	return 0;
}


int main2()
{
	char a = -128;
	char b = 128;
	printf("%u\n", a);//%u打印,打印的数是无符号数-认为a中存放的是无符号数-4294967168
	//-128的原码:10000000 00000000 00000000 10000000
	//      反码:11111111 11111111 11111111 01111111 -符号位不变,其他按位取反
	//      补码:11111111 11111111 11111111 10000000-反码+1
	//由于a只能存8个bit a-10000000
	//a char类型需要整型提升,char是有符号数-所以高位补1
	//11111111 11111111 11111111 10000000-直接作为数字打印
	printf("%u\n", b);
	//128的原反补码相同:00000000 00000000 00000000 10000000
	//b为char类型,只能存8个bit-10000000
	//char a 为有符号数,高位为符号位-符号位补1
	//11111111 11111111 11111111 10000000
	//补位后以无符号数打印-结果4294967168
	return 0;
}


//char到底是有符号的还是无符号的是取决于编译器的
//在vs上char == signed char
int main1()
{
	//signed char 类型的取值范围是 -128~127
	//对于unsigned char的范围是0~255
	char a = -1;
	//-1的补码是全1 补码: 11111111 11111111  11111111 11111111 
	//char只能存八个比特位 11111111
	//以%d的形式打印要进行整型提升: 补码11111111 11111111  11111111 11111111-得到-1
	signed char b = -1;//有符号
	//提升:11111111 11111111  11111111 11111111-得到-1
	//11111111 b
	unsigned char c = -1;//无符号
	//无符号提升 高位补0
	//00000000 00000000 00000000 11111111-255 c
	printf("a=%d,b=%d,c=%d\n", a, b, c);//-1 -1 255
	return 0;
}

