#define _CRT_SECURE_NO_WARNIGNS 1
#include<stdio.h>
#include<stdlib.h>
//int main()
//{
//	int a, b;      //&&称为与 左右两个表达式真为真
//	a = 4;         //||称为或 左右两个表达式中至少有一个为真则为真
//	               //!称为非 非真为假 非假为真
//	b = 5;
//	printf("(!a)=%d\n", !a);//a为真 故！a为假
//	printf("(a&&b)=%d\n", a && b);//a为真，b为真，故a&&b为真
//	printf("(a||b)=%d\n", a || b);//a为真，b为真，故a||b为真
//	printf("(4&&0||2)=%d\n", 4 && 0 || 2);//4为真，0为假，故4&&0为假为0;2为真,所以0||2为真             -的优先级比较高
//	printf("(5>3&&2||8<4-!0)=%d\n", 5 > 3 && 2 || 8 < 4 - !0);//5>3为真为1,1&&2为真为1,1||8为真结果为1,先执行4-！0=4-1=3,1<3为真
//	printf("('c'&&'b')=%d\n", 'c' && 'b');//两个字符串为真结果为1
//	return 0;
//}