#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<stdlib.h>
int main()
{
	int a = 3;//a为正数，原码，反码，补码相同
	int b = -5;
	int c = a | b;
	printf("%d ", c);
	//a的补码：00000000 00000000 00000000 00000011
	//c的原码：10000000 00000000 00000000 00000101
	//c的反码：11111111 11111111 11111111 11111010
	//c的补码：11111111 11111111 11111111 11111011

	//a的补码：00000000 00000000 00000000 00000011
	//c的补码：11111111 11111111 11111111 11111011  按为或 有1为1
	//a|c     11111111 11111111 11111111 111111011 最终所得补码与-5的补码相同 所以结果为-5

	return 0;
}