#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)
#include<stdio.h>
#include<stdlib.h>
//移位操作符的操作数只能是整数-移位移动的是二进制位
int main()//右移操作符 有除2的效果
{
	//逻辑右移：左边用0填充 右边丢弃
	//算术右移：左边用该原值的符号位填充，右边丢弃
	//（右移方式主要取决于编译器的视线，常见的编译器是算术右移）
	int a = 6;
	printf("a=%d\n", a);
	//a的二进制数字：00000000 00000000 00000000 00000110
	int b = a >> 1;
	printf("b=%d\n", b);
	//b的二进制数字：000000000 00000000 00000000 0000011//变成3
	return 0;
}

int main1()//左移操作符 左移有乘2的效果
{
	int a = 6;
	printf("a=%d\n", a);
	//a的二进制数字：00000000 00000000 00000000 00000110
	int b = a << 1;//a左移1位
	printf("b=%d\n", b);
	//对a的二进制数字 左边丢弃一位数 右边补0
	//0000000 00000000 00000000 000001100 //变成12
	return 0;
}